api/soap/src/test/request.xml

<!--
test service with:
"curl &#45;&#45;header "content-type: text/xml" -d @request.xml http://localhost:8080/ws"
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="https://markusnewtonh.com/api-bench">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getEchoRequest>
            <gs:data>
                TEST DATA
            </gs:data>
        </gs:getEchoRequest>
    </soapenv:Body>
</soapenv:Envelope>
